#=============================================================================
#  [RGSS2] Interpreter 108 EX - v1.0.2
# ---------------------------------------------------------------------------
#  Copyright (c) 2021 CACAO
#  Released under the MIT License.
#  https://opensource.org/licenses/mit-license.php
# ---------------------------------------------------------------------------
#  [Twitter] https://twitter.com/cacao_soft/
#  [GitHub]  https://github.com/cacao-soft/
#=============================================================================

=begin

 -- 概    要 ----------------------------------------------------------------

  イベントコマンドの「注釈」の内容を読み込みます。

 -- 注意事項 ----------------------------------------------------------------

  ※ 他のＣＡＣＡＯ製スクリプトより上、もしくはＣＢＳ直下に配置して下さい。
  ※ 注釈処理を行っているスクリプトと高確率で競合します。

=end


#/////////////////////////////////////////////////////////////////////////////#
#                                                                             #
#                  このスクリプトに設定項目はありません。                     #
#                                                                             #
#/////////////////////////////////////////////////////////////////////////////#


# ＣＡＣＡＯ製の注釈コマンド追加判定
$CAO_EX108I = true

class Game_Interpreter
  #--------------------------------------------------------------------------
  # ○ イベントコマンドの実行
  #--------------------------------------------------------------------------
  alias _cbs_execute_command execute_command
  def execute_command
    # 実行内容のリストの最後ではなく、注釈コマンドなら
    if !(@index >= @list.size - 1) && @list[@index].code == 108
      @parameters = []  # 注釈の内容の数だけ格納
      for i in 0...6
        # 注釈の１行を代入
        @parameters << @list[@index + i].parameters[0]  
        # 注釈に次の行がないなら
        break if @list[@index + i + 1].code != 408
      end
      # 注釈の処理
      return command_108
    end
    # 注釈以外のイベントを判定
    _cbs_execute_command
  end
  #--------------------------------------------------------------------------
  # ◎ 注釈の処理
  #     ※ alias で書き直して使用する。
  #     ※ 注釈の内容は @parameters に入っている。（複数行）
  #--------------------------------------------------------------------------
  def command_108
    return true
  end
  #--------------------------------------------------------------------------
  # ◎ 注釈の内容をすべて取得
  #     ※ 注釈が続く限り１つの内容として取得します。
  #--------------------------------------------------------------------------
  def get_all_text_108(warp = true)
    index = @index
    params = []   # 注釈の内容の数だけ格納
    while (@list[index].code == 108 || @list[index].code == 408)
      params << @list[index].parameters[0]  # 注釈の１行を代入
      index += 1
    end
    @index = index - 1 if warp  # 注釈後から処理する
    return params
  end
end
