#=============================================================================
#  [RGSS2] オープニングロゴ - v1.0.1
# ---------------------------------------------------------------------------
#  Copyright (c) 2021 CACAO
#  Released under the MIT License.
#  https://opensource.org/licenses/mit-license.php
# ---------------------------------------------------------------------------
#  [Twitter] https://twitter.com/cacao_soft/
#  [GitHub]  https://github.com/cacao-soft/
#=============================================================================

=begin

 -- 概    要 ----------------------------------------------------------------

  ゲーム開始時にロゴを表示します。

 -- 使用方法 ----------------------------------------------------------------

  ★ ロゴ画像
   "Graphics/Pictures" に "Logo" という名前で保存してください。

  ★ トランジション画像
   トランジションを使用する場合は、Graphics フォルダ内に新しく
   Transitions フォルダを作成してください。
   そのフォルダに使用するトランジション画像を保存して
   下記の"IMG_TRANS"にファイル名を設定してください。

=end


#==============================================================================
# ◆ 設定項目
#==============================================================================
class Logo
  #--------------------------------------------------------------------------
  # ◇ ロゴ表示のタイプ（0：アニメーション、1：トランジション）
  #--------------------------------------------------------------------------
    LOGO_TYPE = 1
  #--------------------------------------------------------------------------
  # ◇ アニメーション番号
  #--------------------------------------------------------------------------
    IMG_ANIMATION = 81
  #--------------------------------------------------------------------------
  # ◇ トランジション画像（表示時、消去時）
  #--------------------------------------------------------------------------
    IMG_TRANS = ["009", "001"]
  #--------------------------------------------------------------------------
  # ◇ トランジション（フレーム）
  #--------------------------------------------------------------------------
    TRANSITION = 60
  #--------------------------------------------------------------------------
  # ◇ ロゴの表示時間（フレーム）
  #--------------------------------------------------------------------------
    WAIT_VIEW = 40
  #--------------------------------------------------------------------------
  # ◇ ロゴ表示後のウェイト（フレーム）
  #--------------------------------------------------------------------------
    WAIT_END = 20
end


#/////////////////////////////////////////////////////////////////////////////#
#                                                                             #
#                下記のスクリプトを変更する必要はありません。                 #
#                                                                             #
#/////////////////////////////////////////////////////////////////////////////#


class Logo
  def initialize
    if LOGO_TYPE.zero?
      @logo_sprite = Sprite_Base.new
      @logo_sprite.x = Graphics.width / 2
      @logo_sprite.y = Graphics.height / 2
      ad = load_data("Data/Animations.rvdata")[IMG_ANIMATION]
      @logo_sprite.start_animation(ad)
    else
      @logo_sprite = Sprite.new
      bitmap = Cache.picture("Logo")
      @logo_sprite.x = (544 - bitmap.width) / 2
      @logo_sprite.y = (416 - bitmap.height) / 2
      Graphics.freeze
      @logo_sprite.bitmap = bitmap
    end
    main
  end
  def main
    if LOGO_TYPE.zero?
      while @logo_sprite.animation?
        @logo_sprite.update
        Graphics.update
      end
    else
      Graphics.transition(TRANSITION, "Graphics/Transitions/#{IMG_TRANS[0]}")
      Graphics.wait(WAIT_VIEW)
      Graphics.freeze
      @logo_sprite.bitmap.dispose
      Graphics.transition(TRANSITION, "Graphics/Transitions/#{IMG_TRANS[1]}")
    end
    Graphics.wait(WAIT_END)
    @logo_sprite.dispose
  end
end

$scene = Logo.new unless $BTEST
