#=============================================================================
#  [RGSS2] ラベルのサブルーチン化 - v1.0.1
# ---------------------------------------------------------------------------
#  Copyright (c) 2021 CACAO
#  Released under the MIT License.
#  https://opensource.org/licenses/mit-license.php
# ---------------------------------------------------------------------------
#  [Twitter] https://twitter.com/cacao_soft/
#  [GitHub]  https://github.com/cacao-soft/
#=============================================================================

=begin

 -- 概    要 ----------------------------------------------------------------

  ラベル・ラベルジャンプをサブルーチンとして使用する機能を追加します。

 -- 注意事項 ----------------------------------------------------------------

  ※ サブルーチン化されている処理も順に実行されるため
     サブルーチンの処理の前に「イベント処理の中断」などを設置してください。


=end


#==============================================================================
# ◆ ユーザー設定
#==============================================================================
module CAO
module SUB
  # サブルーチン化するラベル名
  LABEL_FUNCTION = /^[&]/
  # サブルーチンを抜けるラベルジャンプ名
  LABEL_RETURN = "return"
end
end # module CAO


#/////////////////////////////////////////////////////////////////////////////#
#                                                                             #
#                下記のスクリプトを変更する必要はありません。                 #
#                                                                             #
#/////////////////////////////////////////////////////////////////////////////#


class Game_Interpreter
  #--------------------------------------------------------------------------
  # ● クラス変数
  #--------------------------------------------------------------------------
  @@depth_id = []                   # ネストしたイベントＩＤ
  #--------------------------------------------------------------------------
  # ○ クリア
  #--------------------------------------------------------------------------
  alias _cao_clear_sub clear
  def clear
    @last_index_119 = []            # サブルーチンの戻り位置
    _cao_clear_sub
  end
  #--------------------------------------------------------------------------
  # ○ ラベルジャンプ
  #--------------------------------------------------------------------------
  alias _cao_command_119_sub command_119
  def command_119
    case @params[0]
    when CAO::SUB::LABEL_FUNCTION   # サブルーチンへ移動
      @last_index_119 << @index
    when CAO::SUB::LABEL_RETURN     # サブルーチンから戻る
      if @last_index_119[-1].nil?
        if @depth == 0
          msg = "イベント `#{sprintf('%03d', @event_id)}' "
        else
          msg = "コモンイベント `#{sprintf('%03d', @@depth_id[@depth])}' "
        end
        msg += "の #{@index+1} 番目のコマンドで問題が発生しました。\n\n"\
               "サブルーチンの戻り位置が設定されていません。"
        print msg; exit
      end
      @index = @last_index_119.pop
      return true
    end
    _cao_command_119_sub
  end
  #--------------------------------------------------------------------------
  # ○ コモンイベント
  #--------------------------------------------------------------------------
  alias _cao_command_117_sub command_117
  def command_117
    @@depth_id[@depth+1] = @params[0]
    _cao_command_117_sub
  end
end
