#=============================================================================
#  [RGSS2] ヘルプウィンドウ - v1.1.1
# ---------------------------------------------------------------------------
#  Copyright (c) 2021 CACAO
#  Released under the MIT License.
#  https://opensource.org/license/mit
# ---------------------------------------------------------------------------
#  [Twitter] https://twitter.com/cacao_soft/
#  [GitHub]  https://github.com/cacao-soft/
#=============================================================================

=begin

 -- 概    要 ----------------------------------------------------------------

  カスタムメニューに選択項目の１行ヘルプを表示します。

 -- 注意事項 ----------------------------------------------------------------

  ※ このスクリプトの動作には、Custom Menu Base が必要です。

=end


#==============================================================================
# ◆ ユーザー設定
#==============================================================================
module CAO::CM::MH
   #--------------------------------------------------------------------------
   # ◇ 説明文
   #--------------------------------------------------------------------------
   #     ヘルプ文の分岐をする場合は、下記に設定します。
   #     n の場所には、それぞれスイッチ・ＥＶ変数のＩＤを入れてください。
   #       ["$game_switches[n]", "ON", "OFF"]
   #       ["$game_variables[n]", "0", "1", "2", "3"]
   #       '%CAO::CM::Commands.set_switche_text(n, "ON", "OFF")'
   #       '%CAO::CM::Commands.set_variable_text(n, ["0", "1", "2"])'
   #--------------------------------------------------------------------------
   TEXT_HELP = [
     "アイテムを使用します",
     "スキルを使用します",
     "装備を変更します",
     "ステータスを確認します",
     "セーブします",
     "ゲームを終了します"
   ]

   #--------------------------------------------------------------------------
   # ◇ ウィンドウの位置とサイズ
   #--------------------------------------------------------------------------
   WINDOW_X = 0        # ｘ座標
   WINDOW_Y = 0        # ｙ座標
   WINDOW_WIDTH = 544  # 横幅
   WINDOW_HEIGHT = 56  # 縦幅

   #--------------------------------------------------------------------------
   # ◇ テキストの表示位置
   #--------------------------------------------------------------------------
   #     value : アラインメント (0..左揃え、1..中央揃え、2..右揃え)
   #--------------------------------------------------------------------------
   TEXT_ALIGN = 1

   #--------------------------------------------------------------------------
   # ◇ ウィンドウスキンを使用する。
   #--------------------------------------------------------------------------
   #     false : ウィンドウ枠が非表示になります。
   #--------------------------------------------------------------------------
   WINDOW_DISPLAY = true

 end


 #/////////////////////////////////////////////////////////////////////////////#
 #                                                                             #
 #                下記のスクリプトを変更する必要はありません。                 #
 #                                                                             #
 #/////////////////////////////////////////////////////////////////////////////#


 class Window_MenuHelp < Window_Base
   include CAO::CM::MH
   #--------------------------------------------------------------------------
   # ● オブジェクト初期化
   #--------------------------------------------------------------------------
   def initialize
     if CAO::CM::CMD_NAME.size != TEXT_HELP.size
       msg = "メニュー項目とヘルプの項目数が一致しません。"\
             "(#{CAO::CM::CMD_NAME.size} : #{TEXT_HELP.size})"
       raise CustomizeError, msg, __FILE__
     end
     super(WINDOW_X, WINDOW_Y, WINDOW_WIDTH, WINDOW_HEIGHT)
     self.opacity = 0 unless WINDOW_DISPLAY
   end
   #--------------------------------------------------------------------------
   # ● テキスト設定
   #     text  : ウィンドウに表示する文字列
   #     align : アラインメント (0..左揃え、1..中央揃え、2..右揃え)
   #--------------------------------------------------------------------------
   def set_text(index, align = 0)
     text = CAO::CM::Commands.convert_text(TEXT_HELP[index])
     if text != @text or align != @align
       self.contents.clear
       self.contents.font.color = normal_color
       self.contents.draw_text(4, 0, self.width - 40, WLH, text, align)
       @text = text
       @align = align
     end
   end
 end

 class Scene_Menu
   #--------------------------------------------------------------------------
   # ○ オプションウィンドウの作成
   #--------------------------------------------------------------------------
   alias _cao_create_option_window_cm_help create_option_window
   def create_option_window
     _cao_create_option_window_cm_help
     @help_window = Window_MenuHelp.new
     @component[:opt_help] = @help_window
   end
   #--------------------------------------------------------------------------
   # ○ オプションウィンドウの解放
   #--------------------------------------------------------------------------
   alias _cao_dispose_option_window_cm_help dispose_option_window
   def dispose_option_window
     _cao_dispose_option_window_cm_help
     @help_window.dispose
   end
   #--------------------------------------------------------------------------
   # ○ オプションウィンドウの更新
   #--------------------------------------------------------------------------
   alias _cao_update_option_window_cm_help update_option_window
   def update_option_window
     _cao_update_option_window_cm_help
     @help_window.set_text(@command_window.index, MH::TEXT_ALIGN)
   end
 end
