#=============================================================================
#  [RGSS2] 隊列ウィンドウ - v1.0.2
# ---------------------------------------------------------------------------
#  Copyright (c) 2021 CACAO
#  Released under the MIT License.
#  https://opensource.org/license/mit
# ---------------------------------------------------------------------------
#  [Twitter] https://twitter.com/cacao_soft/
#  [GitHub]  https://github.com/cacao-soft/
#=============================================================================

=begin

 -- 概    要 ----------------------------------------------------------------

  カスタムメニューに隊列を表示するウィンドウ（160 x 80）を追加します。

 -- 注意事項 ----------------------------------------------------------------

  ※ このスクリプトの動作には、Custom Menu Base が必要です。

=end


#==============================================================================
# ◆ ユーザー設定
#==============================================================================
module CAO::CM::Formation
  #--------------------------------------------------------------------------
  # ◇ ウィンドウの位置
  #--------------------------------------------------------------------------
  WINDOW_X = 0    # ｘ座標
  WINDOW_Y = 280  # ｙ座標

  #--------------------------------------------------------------------------
  # ◇ 中央線の色
  #--------------------------------------------------------------------------
  #   Color.new(0, 0, 0, 0) : ライン非表示
  #--------------------------------------------------------------------------
  COLOR_LINE = Color.new(224, 16, 0)

  #--------------------------------------------------------------------------
  # ◇ ウィンドウスキンを使用する。
  #--------------------------------------------------------------------------
  #   false   : ウィンドウ枠が非表示になります。
  #--------------------------------------------------------------------------
  WINDOW_DISPLAY = true

end


#/////////////////////////////////////////////////////////////////////////////#
#                                                                             #
#                下記のスクリプトを変更する必要はありません。                 #
#                                                                             #
#/////////////////////////////////////////////////////////////////////////////#


class Window_CustomMenuFormation < Window_Base
  include CAO::CM::Formation
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize
    super(WINDOW_X, WINDOW_Y, 160, 80)
    self.opacity = 0 unless WINDOW_DISPLAY
    refresh
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュ
  #--------------------------------------------------------------------------
  def refresh
    self.contents.clear
    self.contents.fill_rect(0, 24, 128, 1, COLOR_LINE)
    for i in 0...$game_party.members.size
      actor = $game_party.members[i]
      pos = ((defined? actor.position) ? actor.position : actor.class.position)
      draw_actor_graphic(actor, i * 32 + 16, 8 * (pos <=> 1) + 40)
    end
  end
end

class Scene_Menu
  #--------------------------------------------------------------------------
  # ○ オプションウィンドウの作成
  #--------------------------------------------------------------------------
  alias _cao_create_option_window_cm_formation create_option_window
  def create_option_window
    _cao_create_option_window_cm_formation
    @formation_window = Window_CustomMenuFormation.new
    @component[:option] << @formation_window
    @component[:opt_formation] = @formation_window
  end
  #--------------------------------------------------------------------------
  # ○ オプションウィンドウの解放
  #--------------------------------------------------------------------------
  alias _cao_dispose_option_window_cm_formation dispose_option_window
  def dispose_option_window
    _cao_dispose_option_window_cm_formation
    @formation_window.dispose
  end
end
