# マルチインプット導入時のみ使用可能
class Window_NameInput < Window_Base
  HANKANA = [ 'ｱ','ｲ','ｳ','ｴ','ｵ', 'ｶﾞ','ｷﾞ','ｸﾞ','ｹﾞ','ｺﾞ',
              'ｶ','ｷ','ｸ','ｹ','ｺ', 'ｻﾞ','ｼﾞ','ｽﾞ','ｾﾞ','ｿﾞ',
              'ｻ','ｼ','ｽ','ｾ','ｿ', 'ﾀﾞ','ﾁﾞ','ﾂﾞ','ﾃﾞ','ﾄﾞ',
              'ﾀ','ﾁ','ﾂ','ﾃ','ﾄ', 'ﾊﾞ','ﾋﾞ','ﾌﾞ','ﾍﾞ','ﾎﾞ',
              'ﾅ','ﾆ','ﾇ','ﾈ','ﾉ', 'ﾊﾟ','ﾋﾟ','ﾌﾟ','ﾍﾟ','ﾎﾟ',
              'ﾊ','ﾋ','ﾌ','ﾍ','ﾎ', 'ｧ', 'ｨ', 'ｩ', 'ｪ', 'ｫ' ,
              'ﾏ','ﾐ','ﾑ','ﾒ','ﾓ', 'ｯ', 'ｬ', 'ｭ', 'ｮ', 'ｳﾞ',
              'ﾔ', '','ﾕ', '','ﾖ', 'ﾜ', 'ｦ', 'ﾝ', 'ﾞ', 'ﾟ' ,
              'ﾗ','ﾘ','ﾙ','ﾚ','ﾛ', '-', '=', '_', ' ', 'BS' ]
  TABLE << HANKANA
end
